# DataFrame

Here pandas will interpret the outer dict keys as the columns and the inner keys as the row indices.

In [ ]:
2D arrays conatined within its attached row and column labels
Heterogeneous types, missing data can be defined as spredd sheet programs an database frameworks
Can be created by a NumPy array, 2D NumPy array, Dicts, Series, Lists.

In [1]:
import numpy as np
import pandas as pd

# create Dict of series

In [2]:
dict={'X':pd.Series(['A','B','C']),'Y':pd.Series([1, 2, 3])}

In [3]:
dict

{'X': 0    A
 1    B
 2    C
 dtype: object, 'Y': 0    1
 1    2
 2    3
 dtype: int64}

In [4]:
pd.DataFrame(dict)

   X  Y
0  A  1
1  B  2
2  C  3

# Create from dict of lists

In [5]:
dict={'X':['A','B','C'],'Y':[1,2,3]}

In [6]:
pd.DataFrame(dict)

   X  Y
0  A  1
1  B  2
2  C  3

# Create from dicts of dicts

In [7]:
dict = {'col' : {'R1':1.2,'R2':2.2}, 'col2':{'R1':3.2,'R2':4.2, 'R3':5.5}}
pd.DataFrame(dict)

    col  col2
R1  1.2   3.2
R2  2.2   4.2
R3  NaN   5.5

In [8]:
# List from List
list=[['A','B','C'],[1,2,3]]

In [9]:
list

[['A', 'B', 'C'], [1, 2, 3]]

In [10]:
for i in list:
    print(i)

['A', 'B', 'C']
[1, 2, 3]

In [11]:
pd.DataFrame(list)

   0  1  2
0  A  B  C
1  1  2  3

# Create from list of dicts

In [12]:
list=[{'R1':1.2,'R2':2.2}, {'R1':3.2,'R2':4.2, 'R3':5.5}]

In [13]:
pd.DataFrame(list)

    R1   R2   R3
0  1.2  2.2  NaN
1  3.2  4.2  5.5

# Create with custom index
DIct iniside List

In [23]:
dict= {
    'col1' : [1,2,3,4],
    'col3' : [5,6,7,8],
    'col2' : ['A','B','C','D'],
    'col4' : ['X','Y','Z','']
}

In [24]:
pd.DataFrame(dict)

   col1  col3 col2 col4
0     1     5    A    X
1     2     6    B    Y
2     3     7    C    Z
3     4     8    D

In [26]:
# Random Values
pd.DataFrame(np.arange(9).reshape((3, 3)),
             index=['R1', 'R2', 'R3'],
             columns=['col1', 'col2', 'col3'])

    col1  col2  col3
R1     0     1     2
R2     3     4     5
R3     6     7     8

# Filtering Out Missing Data

In [29]:
data = pd.Series([1.2, np.nan, 2.5, np.nan, 7])
data

0    1.2
1    NaN
2    2.5
3    NaN
4    7.0
dtype: float64

In [30]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [32]:
data[data.notnull()]

0    1.2
2    2.5
4    7.0
dtype: float64

In [31]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [33]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [34]:
data

0    1.2
1    NaN
2    2.5
3    NaN
4    7.0
dtype: float64

In [35]:
data.dropna() # Alternative way for not null, by using dropna() method.

0    1.2
2    2.5
4    7.0
dtype: float64

In [37]:
from numpy import nan as NA
data1 = pd.Series([1.2, NA, 2.5, NA, 7])
data1

0    1.2
1    NaN
2    2.5
3    NaN
4    7.0
dtype: float64

In [38]:
df=pd.DataFrame([[2.3,4.5,6.0],[2.3,np.nan,3.4],[np.nan,np.nan,np.nan],[np.nan,4.6,4.4]])

In [39]:
df

     0    1    2
0  2.3  4.5  6.0
1  2.3  NaN  3.4
2  NaN  NaN  NaN
3  NaN  4.6  4.4

# Drop all the rows that having missing values (NaN)

In [41]:
df.dropna()

     0    1    2
0  2.3  4.5  6.0

# Drop the rows that having all missing values (NaN) only

In [44]:
df

     0    1    2
0  2.3  4.5  6.0
1  2.3  NaN  3.4
2  NaN  NaN  NaN
3  NaN  4.6  4.4

In [45]:
df.dropna(how='all')

     0    1    2
0  2.3  4.5  6.0
1  2.3  NaN  3.4
3  NaN  4.6  4.4

In [50]:
df['COl3'] = NA
df

     0    1    2  COl3
0  2.3  4.5  6.0   NaN
1  2.3  NaN  3.4   NaN
2  NaN  NaN  NaN   NaN
3  NaN  4.6  4.4   NaN

# Drop the columns that having all missing values (NaN) only.

In [51]:
df.dropna(axis=1, how='all')

     0    1    2
0  2.3  4.5  6.0
1  2.3  NaN  3.4
2  NaN  NaN  NaN
3  NaN  4.6  4.4

# Filling in Missing Data

In [52]:
df

     0    1    2  COl3
0  2.3  4.5  6.0   NaN
1  2.3  NaN  3.4   NaN
2  NaN  NaN  NaN   NaN
3  NaN  4.6  4.4   NaN

In [53]:
df.fillna(100)

       0      1      2   COl3
0    2.3    4.5    6.0  100.0
1    2.3  100.0    3.4  100.0
2  100.0  100.0  100.0  100.0
3  100.0    4.6    4.4  100.0

In [54]:
#Filling missing values (NaN) by preceding values using option method='ffill'.
df.fillna(method='ffill')

     0    1    2  COl3
0  2.3  4.5  6.0   NaN
1  2.3  4.5  3.4   NaN
2  2.3  4.5  3.4   NaN
3  2.3  4.6  4.4   NaN

In [55]:

df.fillna(method='ffill', limit=1) # Fill upto row index 1

     0    1    2  COl3
0  2.3  4.5  6.0   NaN
1  2.3  4.5  3.4   NaN
2  2.3  NaN  3.4   NaN
3  NaN  4.6  4.4   NaN

In [56]:
df.fillna(0, inplace=True)

In [57]:
df

     0    1    2  COl3
0  2.3  4.5  6.0   0.0
1  2.3  0.0  3.4   0.0
2  0.0  0.0  0.0   0.0
3  0.0  4.6  4.4   0.0

In [58]:
df1 = pd.DataFrame(np.random.randn(6, 3))
df1.iloc[2:, 1] = NA
df1.iloc[4:, 2] = NA
df1

          0         1         2
0  0.714334  0.465538 -0.866372
1  0.374101 -0.959563  0.558904
2  1.123459       NaN  0.209717
3  1.239822       NaN -1.078399
4  0.948788       NaN       NaN
5 -0.759197       NaN       NaN